Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
/********************************************************************
**版权所有：       深圳市几米物联有限公司
**文件名称：       uart_driver.c
**文件描述：       UART驱动模块实现文件
**当前版本：       V1.0
**作    者：       Harrison Wu (wuyujiao@jimiiot.com)
**完成日期：       2026.04.22
*********************************************************************
** 功能描述：       1. 实现多UART独立管理和状态机控制
**                 2. 实现注册/卸载/收发/电源管理功能
**                 3. 支持DMA、IDLE、RingBuffer、低功耗
**                 4. 驱动层与应用层完全解耦，内存由应用层管理
*********************************************************************/

#include "uart_driver.h"
#include "gd32f50x_usart.h"
#include <string.h>

/*********************************************************************
 * 内部数据结构定义
 *********************************************************************/

/**
 * @brief UART现场保存结构体（用于suspend/resume）
 */
typedef struct {
    uint32_t baudrate;          /**< 保存的波特率 */
    uint32_t stat;              /**< 保存的STAT寄存器值 */
    uint32_t ctrl0;             /**< 保存的CTRL0寄存器值 */
    uint32_t ctrl1;             /**< 保存的CTRL1寄存器值 */
    uint32_t ctrl2;             /**< 保存的CTRL2寄存器值 */
} drv_uart_context_t;

/**
 * @brief UART控制结构体（驱动内部维护）
 */
typedef struct {
    drv_uart_config_t   config;             /**< 应用层配置参数（只读） */
    drv_uart_state_e    state;              /**< 当前状态 */
    SemaphoreHandle_t tx_mutex;         /**< 发送互斥锁 */
    drv_uart_context_t  context;            /**< 挂起时的现场保存 */
    uint16_t        dma_rx_len;         /**< DMA接收数据长度 */
    uint16_t        rx_write_index;     /**< rx_buf写指针（中断中使用） */
    uint16_t        rx_read_index;      /**< rx_buf读指针（应用层使用） */
    uint8_t         rx_mode;            /**< 接收模式标识（注册时确定） */
    uint8_t         irq_enabled;        /**< 中断使能标志（注册时确定） */
} drv_uart_ctrl_t;

/*********************************************************************
 * 内部全局变量
 *********************************************************************/

/** UART控制实例数组 */
static drv_uart_ctrl_t s_uart_ctrl[DRV_UART_PORT_MAX] = {0};

/** USART基地址映射表 */
static uint32_t const s_usart_base[DRV_UART_PORT_MAX] = {
    USART0,
    USART1,
    USART2,
    UART3,
    UART4
};

/*********************************************************************
 * 内部辅助函数声明
 *********************************************************************/

static int _drv_uart_check_param(const drv_uart_config_t *config);
static int _drv_uart_hw_init(drv_uart_port_e port);
static int _drv_uart_hw_deinit(drv_uart_port_e port);
static int _drv_uart_enable_interrupt(drv_uart_port_e port);
static int _drv_uart_disable_interrupt(drv_uart_port_e port);
static int _drv_uart_enable_dma_rx(drv_uart_port_e port);
static int _drv_uart_disable_dma_rx(drv_uart_port_e port);

/*********************************************************************
 * 内部辅助函数实现
 *********************************************************************/

/*********************************************************************
 * @brief   检查配置参数合法性
 * @param   config  配置结构体指针
 * @return  0表示合法，-1表示非法
 * @note    无
 *********************************************************************/
static int _drv_uart_check_param(const drv_uart_config_t *config)
{
    if (config == NULL)
    {
        DRV_UART_LOGE("Invalid UART config parameter");
        return -1;
    }

    if (config->port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", config->port);
        return -1;
    }

    if (config->rx_buf == NULL || config->rx_buf_size == 0)
    {
        DRV_UART_LOGE("Invalid UART RX buffer");
        return -1;
    }

    if (config->use_dma_rx == true)
    {
        if (config->dma_rx_buf == NULL || config->dma_rx_buf_size == 0)
        {
            DRV_UART_LOGE("Invalid DMA RX buffer");
            return -1;
        }
    }

    if (config->use_ringbuf == true)
    {
        if (config->ringbuf == NULL)
        {
            DRV_UART_LOGE("Invalid RingBuffer pointer");
            return -1;
        }
    }

    return 0;
}

/*********************************************************************
 * @brief   UART硬件初始化
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    配置波特率、数据位、停止位、校验位等
 *********************************************************************/
static int _drv_uart_hw_init(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid port: %d", port);
        return -1;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    DRV_UART_LOGD("Hardware init UART port %d, baudrate=%d", port, ctrl->config.baudrate);

    /* 使能UART时钟和GPIO时钟（根据端口配置） */
    if (port == DRV_UART_PORT_USART0)
    {
        rcu_periph_clock_enable(RCU_USART0);
    }
    else if (port == DRV_UART_PORT_USART1)
    {
        rcu_periph_clock_enable(RCU_USART1);
    }
    else if (port == DRV_UART_PORT_USART2)
    {
        rcu_periph_clock_enable(RCU_USART2);
    }
    else if (port == DRV_UART_PORT_UART3)
    {
        rcu_periph_clock_enable(RCU_UART3);
    }
    else if (port == DRV_UART_PORT_UART4)
    {
        rcu_periph_clock_enable(RCU_UART4);
    }

    /* 配置UART参数 */
    usart_deinit(usart_base);
    usart_baudrate_set(usart_base, ctrl->config.baudrate);
    usart_word_length_set(usart_base, USART_WL_8BIT);
    usart_stop_bit_set(usart_base, USART_STB_1BIT);
    usart_parity_config(usart_base, USART_PM_NONE);
    usart_hardware_flow_rts_config(usart_base, USART_RTS_DISABLE);
    usart_hardware_flow_cts_config(usart_base, USART_CTS_DISABLE);
    usart_receive_config(usart_base, USART_RECEIVE_ENABLE);
    usart_transmit_config(usart_base, USART_TRANSMIT_ENABLE);
    usart_enable(usart_base);

    DRV_UART_LOGD("UART port %d hardware initialized", port);

    return 0;
}

/*********************************************************************
 * @brief   UART硬件去初始化
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    关闭UART外设和时钟
 *********************************************************************/
static int _drv_uart_hw_deinit(drv_uart_port_e port)
{
    uint32_t usart_base;

    if (port >= DRV_UART_PORT_MAX)
    {
        return -1;
    }

    usart_base = s_usart_base[port];

    usart_disable(usart_base);

    /* 关闭UART时钟 */
    if (port == DRV_UART_PORT_USART0)
    {
        rcu_periph_clock_disable(RCU_USART0);
    }
    else if (port == DRV_UART_PORT_USART1)
    {
        rcu_periph_clock_disable(RCU_USART1);
    }
    else if (port == DRV_UART_PORT_USART2)
    {
        rcu_periph_clock_disable(RCU_USART2);
    }
    else if (port == DRV_UART_PORT_UART3)
    {
        rcu_periph_clock_disable(RCU_UART3);
    }
    else if (port == DRV_UART_PORT_UART4)
    {
        rcu_periph_clock_disable(RCU_UART4);
    }

