Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    return 0;
}

/*********************************************************************
 * @brief   使能UART中断
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    使能RXNE中断，如果配置了IDLE则使能IDLE中断
 *********************************************************************/
static int _drv_uart_enable_interrupt(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;

    if (port >= DRV_UART_PORT_MAX)
    {
        return -1;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    /* 使能接收中断 */
    usart_interrupt_enable(usart_base, USART_INT_RBNE);

    /* 如果启用IDLE中断 */
    if (ctrl->config.use_idle == true)
    {
        usart_interrupt_enable(usart_base, USART_INT_IDLE);
    }

    /* 使能错误中断 */
    usart_interrupt_enable(usart_base, USART_INT_ERR);

    DRV_UART_LOGD("UART port %d interrupts enabled, IDLE=%d", port, ctrl->config.use_idle);

    return 0;
}

/*********************************************************************
 * @brief   禁能UART中断
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    无
 *********************************************************************/
static int _drv_uart_disable_interrupt(drv_uart_port_e port)
{
    uint32_t usart_base;

    if (port >= DRV_UART_PORT_MAX)
    {
        return -1;
    }

    usart_base = s_usart_base[port];

    usart_interrupt_disable(usart_base, USART_INT_RBNE);
    usart_interrupt_disable(usart_base, USART_INT_IDLE);
    usart_interrupt_disable(usart_base, USART_INT_ERR);

    DRV_UART_LOGD("UART port %d interrupts disabled", port);

    return 0;
}

/*********************************************************************
 * @brief   使能DMA接收
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    配置DMA通道并启动DMA接收
 *********************************************************************/
static int _drv_uart_enable_dma_rx(drv_uart_port_e port)
{
    /* TODO: 根据具体端口配置DMA通道 */
    /* 这里需要根据GD32F505的DMA通道映射来配置 */

    return 0;
}

/*********************************************************************
 * @brief   禁能DMA接收
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败
 * @note    无
 *********************************************************************/
static int _drv_uart_disable_dma_rx(drv_uart_port_e port)
{
    /* TODO: 关闭DMA通道 */

    return 0;
}

/*********************************************************************
 * 接口函数实现
 *********************************************************************/

/*********************************************************************
 * @brief   注册UART端口
 * @param   config  UART配置结构体指针（应用层传入）
 * @return  0表示成功，-1表示失败（参数错误或端口已注册）
 * @note    应用层需确保配置参数合法，所有内存资源由应用层分配管理
 *********************************************************************/
int drv_uart_register(const drv_uart_config_t *config)
{
    drv_uart_ctrl_t *ctrl;
    drv_uart_port_e port;

    /* 断言检查：配置指针不能为空 */
    DRV_UART_ASSERT(config != NULL);

    /* 参数检查 */
    if (_drv_uart_check_param(config) != 0)
    {
        DRV_UART_LOGE("Invalid config parameter for port");
        return -1;
    }

    port = config->port;
    ctrl = &s_uart_ctrl[port];

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    /* 检查端口是否已注册 */
    if (ctrl->state != DRV_UART_STATE_UNINIT)
    {
        DRV_UART_LOGW("UART port %d already registered, state=%d", port, ctrl->state);
        return -1;
    }

    /* 保存配置参数 */
    memcpy(&ctrl->config, config, sizeof(drv_uart_config_t));

    /* 初始化接收模式标识 */
    if (config->use_dma_rx == true)
    {
        ctrl->rx_mode = (config->use_ringbuf == true) ? DRV_UART_RX_MODE_DMA_RINGBUF : DRV_UART_RX_MODE_DMA_RXBUF;
    }
    else
    {
        ctrl->rx_mode = (config->use_ringbuf == true) ? DRV_UART_RX_MODE_NODMA_RINGBUF : DRV_UART_RX_MODE_NODMA_RXBUF;
    }

    /* 初始化中断使能标志 */
    ctrl->irq_enabled = DRV_UART_IRQ_RBNE | DRV_UART_IRQ_ERR;  /* RXNE和ERR总是使能 */
    if (config->use_idle == true)
    {
        ctrl->irq_enabled |= DRV_UART_IRQ_IDLE;
    }

    /* 根据配置创建发送互斥锁 */
    if (config->use_tx_mutex == true)
    {
        ctrl->tx_mutex = xSemaphoreCreateMutex();
        if (ctrl->tx_mutex == NULL)
        {
            DRV_UART_LOGE("Failed to create TX mutex for port %d", port);
            return -1;
        }

        DRV_UART_LOGD("TX mutex created for port %d", port);
    }
    else
    {
        ctrl->tx_mutex = NULL;
        DRV_UART_LOGD("TX mutex disabled for port %d", port);
    }

    /* 初始化状态 */
    ctrl->state = DRV_UART_STATE_INIT;

    /* 硬件初始化 */
    if (_drv_uart_hw_init(port) != 0)
    {
        DRV_UART_LOGE("Hardware init failed for port %d", port);
        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->state = DRV_UART_STATE_UNINIT;
        return -1;
    }

    /* 如果启用DMA接收 */
    if (config->use_dma_rx == true)
    {
        if (_drv_uart_enable_dma_rx(port) != 0)
        {
            DRV_UART_LOGE("DMA RX enable failed for port %d", port);
            _drv_uart_hw_deinit(port);
            vSemaphoreDelete(ctrl->tx_mutex);
            ctrl->state = DRV_UART_STATE_UNINIT;
            return -1;
        }
    }

    /* 使能中断 */
    if (_drv_uart_enable_interrupt(port) != 0)
    {
        DRV_UART_LOGE("Interrupt enable failed for port %d", port);
        if (config->use_dma_rx == true)
        {
            _drv_uart_disable_dma_rx(port);
        }
        _drv_uart_hw_deinit(port);
        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->state = DRV_UART_STATE_UNINIT;
        return -1;
    }

    /* 切换到活跃状态 */
    ctrl->state = DRV_UART_STATE_ACTIVE;

    DRV_UART_LOGI("UART port %d registered successfully, baudrate=%d, DMA_RX=%d, IDLE=%d, RingBuf=%d",
                  port, config->baudrate, config->use_dma_rx, config->use_idle, config->use_ringbuf);

    return 0;
}

/*********************************************************************
 * @brief   卸载UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口未初始化）
 * @note    释放驱动内部资源，应用层传入的内存由应用层自行管理
 *********************************************************************/
int drv_uart_deinit(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return -1;
    }

    ctrl = &s_uart_ctrl[port];

