Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
    /* 检查端口状态 */
    if (ctrl->state == DRV_UART_STATE_UNINIT)
    {
        DRV_UART_LOGW("UART port %d not initialized", port);
        return -1;
    }

    /* 关闭中断 */
    _drv_uart_disable_interrupt(port);

    /* 关闭DMA */
    if (ctrl->config.use_dma_rx == true)
    {
        _drv_uart_disable_dma_rx(port);
    }

    /* 硬件去初始化 */
    _drv_uart_hw_deinit(port);

    /* 释放互斥锁 */
    if (ctrl->tx_mutex != NULL)
    {
        vSemaphoreDelete(ctrl->tx_mutex);
        ctrl->tx_mutex = NULL;
    }

    /* 清空配置 */
    memset(&ctrl->config, 0, sizeof(drv_uart_config_t));
    memset(&ctrl->context, 0, sizeof(drv_uart_context_t));

    /* 状态重置 */
    ctrl->state = DRV_UART_STATE_UNINIT;

    DRV_UART_LOGI("UART port %d deinitialized successfully", port);

    return 0;
}

/* 以下为待实现的接口函数占位 */

/*********************************************************************
 * @brief   发送数据
 * @param   port    UART端口号
 * @param   data    待发送数据指针
 * @param   len     待发送数据长度（字节）
 * @return  实际发送的字节数，-1表示失败
 * @note    线程安全，支持普通发送和DMA发送（根据配置自动选择）
 *********************************************************************/
int drv_uart_send(drv_uart_port_e port, const uint8_t *data, uint16_t len)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    int send_len = 0;
    uint16_t i;

    /* 断言检查：参数合法性 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);
    DRV_UART_ASSERT(data != NULL);
    DRV_UART_ASSERT(len > 0);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return -1;
    }

    if (data == NULL || len == 0)
    {
        DRV_UART_LOGE("Invalid send parameter");
        return -1;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查：只有活跃状态才能发送 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return -1;
    }

    usart_base = s_usart_base[port];

    /* 如果启用了互斥锁，获取互斥锁（线程安全） */
    if (ctrl->tx_mutex != NULL)
    {
        /* 使用超时机制，避免永久阻塞 */
#if DRV_UART_TX_MUTEX_TIMEOUT_MS > 0
        if (xSemaphoreTake(ctrl->tx_mutex, pdMS_TO_TICKS(DRV_UART_TX_MUTEX_TIMEOUT_MS)) != pdTRUE)
        {
            DRV_UART_LOGE("TX mutex timeout for port %d", port);
            return -1;
        }
#else
        if (xSemaphoreTake(ctrl->tx_mutex, portMAX_DELAY) != pdTRUE)
        {
            DRV_UART_LOGE("Failed to take TX mutex for port %d", port);
            return -1;
        }
#endif
    }

    /* 判断是否启用DMA发送 */
    if (ctrl->config.use_dma_tx == true)
    {
        /* TODO: DMA发送实现（第5步中断处理时完善） */
        DRV_UART_LOGW("DMA TX not implemented yet, use polling mode");

        /* 临时使用轮询发送 */
        for (i = 0; i < len; i++)
        {
            usart_data_transmit(usart_base, data[i]);

            /* 等待发送完成 */
            while (usart_flag_get(usart_base, USART_FLAG_TBE) == RESET)
            {
                ;
            }
        }

        send_len = len;
    }
    else
    {
        /* 普通轮询发送 */
        DRV_UART_LOGD("UART port %d send %d bytes (polling mode)", port, len);

        for (i = 0; i < len; i++)
        {
            usart_data_transmit(usart_base, data[i]);

            /* 等待发送完成 */
            while (usart_flag_get(usart_base, USART_FLAG_TBE) == RESET)
            {
                ;
            }
        }

        /* 等待最后一帧发送完成 */
        while (usart_flag_get(usart_base, USART_FLAG_TC) == RESET)
        {
            ;
        }

        send_len = len;
    }

    /* 如果启用了互斥锁，释放互斥锁 */
    if (ctrl->tx_mutex != NULL)
    {
        xSemaphoreGive(ctrl->tx_mutex);
    }

    DRV_UART_LOGD("UART port %d send completed, len=%d", port, send_len);

    return send_len;
}

/*********************************************************************
 * @brief   读取数据
 * @param   port    UART端口号
 * @param   data    读取数据存放指针
 * @param   len     期望读取的数据长度（字节）
 * @return  实际读取的字节数，-1表示失败
 * @note    从RingBuffer或接收缓存中读取数据
 *********************************************************************/
int drv_uart_read(drv_uart_port_e port, uint8_t *data, uint16_t len)
{
    drv_uart_ctrl_t *ctrl;
    int read_len = 0;

    /* 断言检查：参数合法性 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);
    DRV_UART_ASSERT(data != NULL);
    DRV_UART_ASSERT(len > 0);

    /* 参数校验 */
    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return -1;
    }

    if (data == NULL || len == 0)
    {
        DRV_UART_LOGE("Invalid read parameter");
        return -1;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return -1;
    }

    /* 判断是否启用RingBuffer */
    if (ctrl->config.use_ringbuf == true)
    {
        /* 从RingBuffer读取数据 */
        if (ctrl->config.ringbuf == NULL)
        {
            DRV_UART_LOGE("RingBuffer pointer is NULL for port %d", port);
            return -1;
        }

        read_len = ringbuf_read(ctrl->config.ringbuf, data, len);

        DRV_UART_LOGD("UART port %d read %d bytes from RingBuffer", port, read_len);
    }
    else
    {
        /* 从基础接收缓存读取（循环缓冲区） */
        /* 计算可读取的数据长度 */
        uint16_t available_len;
        uint16_t i;

        if (ctrl->rx_write_index >= ctrl->rx_read_index)
        {
            /* 写指针在读指针之后或相等 */
            available_len = ctrl->rx_write_index - ctrl->rx_read_index;
        }
        else
        {
            /* 写指针在读指针之前（循环） */
            available_len = ctrl->config.rx_buf_size - ctrl->rx_read_index + ctrl->rx_write_index;
        }

        /* 取期望长度和可用长度的较小值 */
        uint16_t copy_len = (len < available_len) ? len : available_len;

        if (copy_len == 0)
        {
            DRV_UART_LOGD("UART port %d no data available", port);
            return 0;
        }

        /* 拷贝数据（需要处理循环情况） */
        for (i = 0; i < copy_len; i++)
        {
            data[i] = ctrl->config.rx_buf[ctrl->rx_read_index];
            ctrl->rx_read_index++;

            if (ctrl->rx_read_index >= ctrl->config.rx_buf_size)
            {
                ctrl->rx_read_index = 0;
            }
        }

