Sandy6Zhou/OC810_GD32F50X/project/OC810/code/driver/uart_driver.c
        read_len = copy_len;

        DRV_UART_LOGD("UART port %d read %d bytes from RX buffer", port, read_len);
    }

    return read_len;
}

/*********************************************************************
 * @brief   挂起UART端口（低功耗）
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口状态不允许挂起）
 * @note    唤醒串口仅关闭TX，普通串口彻底关闭硬件
 *********************************************************************/
int drv_uart_suspend(drv_uart_port_e port)
{
    /* TODO: 第6步实现 */
    (void)port;
    return -1;
}

/*********************************************************************
 * @brief   恢复UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口状态不允许恢复）
 * @note    恢复挂起的UART端口到活跃状态
 *********************************************************************/
int drv_uart_resume(drv_uart_port_e port)
{
    /* TODO: 第6步实现 */
    (void)port;
    return -1;
}

/*********************************************************************
 * @brief   关闭UART端口
 * @param   port    UART端口号
 * @return  0表示成功，-1表示失败（端口未初始化）
 * @note    彻底关闭硬件，可通过resume恢复，不释放控制实例
 *********************************************************************/
int drv_uart_shutdown(drv_uart_port_e port)
{
    /* TODO: 第6步实现 */
    (void)port;
    return -1;
}

/*********************************************************************
 * @brief   获取UART端口状态
 * @param   port    UART端口号
 * @return  UART状态枚举值，-1表示失败（端口无效）
 * @note    用于调试和问题排查
 *********************************************************************/
int drv_uart_get_state(drv_uart_port_e port)
{
    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return -1;
    }

    DRV_UART_LOGD("UART port %d state: %d", port, s_uart_ctrl[port].state);

    return (int)s_uart_ctrl[port].state;
}

/*********************************************************************
 * @brief   查询可读取的接收数据长度
 * @param   port    UART端口号
 * @return  可读取的字节数，-1表示失败（端口无效）
 * @note    应用层可通过此接口查询有多少数据待读取，避免无效调用uart_read
 *********************************************************************/
int drv_uart_get_rx_len(drv_uart_port_e port)
{
    drv_uart_ctrl_t *ctrl;
    uint16_t available_len = 0;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        DRV_UART_LOGE("Invalid UART port: %d", port);
        return -1;
    }

    ctrl = &s_uart_ctrl[port];

    /* 状态检查 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        DRV_UART_LOGW("UART port %d not active, state=%d", port, ctrl->state);
        return -1;
    }

    /* 判断是否启用RingBuffer */
    if (ctrl->config.use_ringbuf == true)
    {
        /* 从RingBuffer查询数据长度 */
        if (ctrl->config.ringbuf == NULL)
        {
            DRV_UART_LOGE("RingBuffer pointer is NULL for port %d", port);
            return -1;
        }

        available_len = (uint16_t)ringbuf_get_data_size(ctrl->config.ringbuf);
    }
    else
    {
        /* 从基础接收缓存计算可读取长度 */
        if (ctrl->rx_write_index >= ctrl->rx_read_index)
        {
            available_len = ctrl->rx_write_index - ctrl->rx_read_index;
        }
        else
        {
            available_len = ctrl->config.rx_buf_size - ctrl->rx_read_index + ctrl->rx_write_index;
        }
    }

    DRV_UART_LOGD("UART port %d rx available: %d bytes", port, available_len);

    return (int)available_len;
}

/*********************************************************************
 * @brief   UART中断处理函数（统一入口）
 * @param   port    UART端口号
 * @return  无
 * @note    本函数由gd32f50x_it.c中的官方中断服务函数调用，例如：
 *          void USART0_IRQHandler(void) { uart_irq_handler(UART_PORT_USART0); }
 *          应用层不应直接调用此函数
 *          优化：直接读取寄存器，避免函数调用开销
 *********************************************************************/
void drv_uart_irq_handler(drv_uart_port_e port)
{
    uint32_t usart_base;
    drv_uart_ctrl_t *ctrl;
    uint8_t data;
    uint16_t dma_len = 0;
    uint32_t stat0;
    uint32_t int0;

    /* 断言检查：端口号必须合法 */
    DRV_UART_ASSERT(port < DRV_UART_PORT_MAX);

    if (port >= DRV_UART_PORT_MAX)
    {
        return;
    }

    usart_base = s_usart_base[port];
    ctrl = &s_uart_ctrl[port];

    /* 检查端口状态，非活跃状态不处理中断 */
    if (ctrl->state != DRV_UART_STATE_ACTIVE)
    {
        return;
    }

    /* 一次性读取状态寄存器和中断使能寄存器（优化：避免多次函数调用） */
    stat0 = USART_STAT0(usart_base);
    int0 = USART_CTL0(usart_base);

    /* 1. 处理RXNE中断（接收数据非空） */
    if ((stat0 & USART_STAT0_RBNE) && (int0 & USART_CTL0_RBNEIE))
    {
        /* 读DR寄存器清除RBNE标志 */
        data = (uint8_t)USART_DATA(usart_base);

        /* 根据接收模式分发处理（switch优化） */
        switch (ctrl->rx_mode)
        {
            case DRV_UART_RX_MODE_NODMA_RINGBUF:
                /* 非DMA + RingBuffer模式 */
                ringbuf_write(ctrl->config.ringbuf, &data, 1);
                break;

            case DRV_UART_RX_MODE_NODMA_RXBUF:
                /* 非DMA + rx_buf模式（循环缓冲区） */
                ctrl->config.rx_buf[ctrl->rx_write_index] = data;
                ctrl->rx_write_index++;
                if (ctrl->rx_write_index >= ctrl->config.rx_buf_size)
                {
                    ctrl->rx_write_index = 0;
                }
                break;

            default:
                /* DMA模式：不处理RXNE，由DMA自动搬运 */
                break;
        }
    }

    /* 2. 处理IDLE中断（空闲帧，一帧数据接收完成） */
    if ((ctrl->irq_enabled & DRV_UART_IRQ_IDLE) && (stat0 & USART_STAT0_IDLEF) && (int0 & USART_CTL0_IDLEIE))
    {
        /* 清除IDLE标志：读STAT0后读DATA */
        (void)USART_DATA(usart_base);

        /* 如果启用DMA接收，计算DMA已接收的数据长度 */
        if (ctrl->config.use_dma_rx == true)
        {
            /* TODO: 获取DMA剩余计数，计算已接收长度 */
            dma_len = ctrl->dma_rx_len;

            /* 将DMA缓冲区数据写入RingBuffer */
            if (ctrl->config.use_ringbuf == true && ctrl->config.ringbuf != NULL)
            {
                if (dma_len > 0)
                {
                    ringbuf_write(ctrl->config.ringbuf, ctrl->config.dma_rx_buf, dma_len);
                }
            }

            /* 重启DMA接收 */
            _drv_uart_enable_dma_rx(port);
        }
        else
        {
            /* 非DMA模式：计算接收长度（简单估算） */
            dma_len = 0;  /* 暂无法精确获取，应用层应从RingBuffer查询 */
        }

        /* 调用接收完成回调 */
        if (ctrl->config.rx_callback != NULL)
        {
            ctrl->config.rx_callback(port, dma_len);
        }
    }

    /* 3. 处理错误中断（只检查使能的错误标志） */
    if (ctrl->irq_enabled & DRV_UART_IRQ_ERR)
    {
        /* 帧错误 */
        if (stat0 & USART_STAT0_FERR)
        {
            USART_STAT0(usart_base) &= ~USART_STAT0_FERR;  /* 写1清除 */

            if (ctrl->config.error_callback != NULL)
            {
                ctrl->config.error_callback(port, DRV_UART_ERROR_FRAME);
            }
        }

        /* 溢出错误 */
        if (stat0 & USART_STAT0_ORERR)
        {
            USART_STAT0(usart_base) &= ~USART_STAT0_ORERR;

            if (ctrl->config.error_callback != NULL)
            {
                ctrl->config.error_callback(port, DRV_UART_ERROR_OVERRUN);
            }
        }

        /* 噪声错误 */
        if (stat0 & USART_STAT0_NERR)
        {
            USART_STAT0(usart_base) &= ~USART_STAT0_NERR;

            if (ctrl->config.error_callback != NULL)
            {
                ctrl->config.error_callback(port, DRV_UART_ERROR_NOISE);
            }
        }

        /* 奇偶校验错误 */
        if (stat0 & USART_STAT0_PERR)
        {
            USART_STAT0(usart_base) &= ~USART_STAT0_PERR;

            if (ctrl->config.error_callback != NULL)
            {
                ctrl->config.error_callback(port, DRV_UART_ERROR_PARITY);
            }
        }
    }

    /* 4. 处理TXE中断（发送数据寄存器空） */
    if ((stat0 & USART_STAT0_TBE) && (int0 & USART_CTL0_TBEIE))
    {
        /* TODO: 中断发送实现（需要添加发送缓冲区） */
        /* 暂时关闭TXE中断，使用轮询发送 */
        USART_CTL0(usart_base) &= ~USART_CTL0_TBEIE;
    }

    /* 5. 处理TC中断（发送完成） */
    if (stat0 & USART_STAT0_TC)
    {
        USART_STAT0(usart_base) &= ~USART_STAT0_TC;

        /* TODO: 发送完成回调 */
    }
}
